doc/nitrogen_doc/validators/custom.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Custom Server-Side Validator Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-06-14 18:34:58 EDT"/>
<meta name="author" content="Rusty Klophaus (@rklophaus)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />
</head>
<body>
<div id="content">

<h1 class="title">Custom Server-Side Validator Element</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | Validators | <a href="../handlers.html">Handlers</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Custom Server-Side Validator - #custom {} </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Custom Server-Side Validator - #custom {} </h2>
<div class="outline-text-2" id="text-1">


<p>
Attach a custom validator, written in Erlang, to an element. The validator will be executed on the server during a postback.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Usage </h3>
<div class="outline-text-3" id="text-1.1">





<pre class="src src-erlang"><span style="color: #929292;">% </span><span style="color: #929292;">Function to validate that a value is either upper or lower case,
</span><span style="color: #929292;">% </span><span style="color: #929292;">depending on the value of Tag...
</span><span style="color: #000000;">F</span> = <span style="color: #FB5D17;">fun</span>(<span style="color: #000000;">Tag</span>, <span style="color: #000000;">Value</span>) -&gt;
  <span style="color: #FB5D17;">case</span> <span style="color: #000000;">Tag</span> <span style="color: #FB5D17;">of</span>
    upper -&gt;<span style="color: #28439B;"> </span><span style="color: #28439B;">string</span>:<span style="color: #28439B;">to_upper</span>(<span style="color: #000000;">Value</span>) == <span style="color: #000000;">Value</span>;
    lower -&gt;<span style="color: #28439B;"> </span><span style="color: #28439B;">string</span>:<span style="color: #28439B;">to_upper</span>(<span style="color: #000000;">Value</span>) == <span style="color: #000000;">Value</span>
  <span style="color: #FB5D17;">end</span>
<span style="color: #FB5D17;">end</span>,
     
<span style="color: #929292;">% </span><span style="color: #929292;">Wire the validator in upper case mode...
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(<span style="color: #000000;">ButtonID</span>, <span style="color: #000000;">TextBoxID</span>, #<span style="color: #28439B;">validate</span> { validators=[
  #<span style="color: #28439B;">custom</span> { text=<span style="color: #09A240;">"Must be uppercase"</span>, function=<span style="color: #000000;">F</span>, tag=upper }
]})
</pre>




</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Attributes </h3>
<div class="outline-text-3" id="text-1.2">


<dl>
<dt>text - (<i>string</i>)</dt><dd>
The text to display if validation fails.

</dd>
<dt>function - (<i>fun</i>)</dt><dd>
An Erlang function that returns true if the value is valid, false if invalid. &lt;br&gt;fun(Tag, Value) -&gt; 'true' or 'false'

</dd>
<dt>tag - (<i>Erlang term</i>)</dt><dd>
Tag value is passed into the custom validation function.
</dd>
</dl>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Rusty Klophaus (@rklophaus)
<a href="mailto:">&lt;&gt;</a>
</p>
<p class="date"> Date: 2010-06-14 18:34:58 EDT</p>
<p class="creator">HTML generated by org-mode 6.33f in emacs 22</p>
</div>
</div>
</body>
</html>
